#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on main.tf line 204, in resource "github_repository" "this":
 204: resource "github_repository" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute branches is decided by the provider alone and therefore there
can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
github_team.this["owners"]: Refreshing state... [id=6944315]
github_membership.this["pagiwal20@gmail.com"]: Refreshing state... [id=PoojasDevOpsWorld:pagiwal]
github_repository.this["common-code"]: Refreshing state... [id=common-code]
github_repository.this["terraform-lib"]: Refreshing state... [id=terraform-lib]
github_team_membership.this["owners:pagiwal20@gmail.com"]: Refreshing state... [id=6944315:pagiwal]
github_team_repository.this["owners:terraform-lib"]: Refreshing state... [id=6944315:terraform-lib]
github_team_repository.this["owners:common-code"]: Refreshing state... [id=6944315:common-code]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # github_team.this["owners"] has changed
  ~ resource "github_team" "this" {
      ~ etag                      = "W/\"3bf185b27204343f588d59af6b06909cf658718b83655b675a6c4319bcbbc629\"" -> "W/\"327b2e539cdfbe8253844b5762e992a376ce85e718404dbd9ace439178a2ded4\""
        id                        = "6944315"
        name                      = "owners"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["cluster"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = true
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Cluster code with the important details about it"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "cluster"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "private"
      + vulnerability_alerts   = true
    }

  # github_repository.this["common-code"] will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge       = false -> true
        id                     = "common-code"
        name                   = "common-code"
        # (27 unchanged attributes hidden)
    }

  # github_team_repository.this["owners:cluster"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "cluster"
      + team_id    = "6944315"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on main.tf line 204, in resource "github_repository" "this":
 204: resource "github_repository" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute branches is decided by the provider alone and therefore there
can be no configured value to compare with. Including this attribute in
ignore_changes has no effect. Remove the attribute from ignore_changes to
quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @agiwalpooja20, Action: `pull_request`, Working Directory: `github/terraform/`, Workflow: `Onboarding`*